7767517
156 171
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 780 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
Clip             Clip_3                   1 1 780 413 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_4                   1 1 413 783 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
Clip             Clip_7                   1 1 783 418 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_8                   1 1 418 786 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Convolution      Conv_9                   1 1 786 789 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Clip             Clip_12                  1 1 789 425 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_13                  1 1 425 792 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Clip             Clip_16                  1 1 792 430 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_17                  1 1 430 795 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Split            splitncnn_0              1 2 795 795_splitncnn_0 795_splitncnn_1
Convolution      Conv_18                  1 1 795_splitncnn_1 798 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Clip             Clip_21                  1 1 798 437 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_22                  1 1 437 801 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Clip             Clip_25                  1 1 801 442 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_26                  1 1 442 804 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
BinaryOp         Add_27                   2 1 795_splitncnn_0 804 445 0=0
Convolution      Conv_28                  1 1 445 807 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Clip             Clip_31                  1 1 807 450 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_32                  1 1 450 810 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Clip             Clip_35                  1 1 810 455 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_36                  1 1 455 813 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Split            splitncnn_1              1 2 813 813_splitncnn_0 813_splitncnn_1
Convolution      Conv_37                  1 1 813_splitncnn_1 816 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Clip             Clip_40                  1 1 816 462 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_41                  1 1 462 819 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Clip             Clip_44                  1 1 819 467 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_45                  1 1 467 822 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
BinaryOp         Add_46                   2 1 813_splitncnn_0 822 470 0=0
Split            splitncnn_2              1 2 470 470_splitncnn_0 470_splitncnn_1
Convolution      Conv_47                  1 1 470_splitncnn_1 825 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Clip             Clip_50                  1 1 825 475 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_51                  1 1 475 828 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Clip             Clip_54                  1 1 828 480 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_55                  1 1 480 831 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
BinaryOp         Add_56                   2 1 470_splitncnn_0 831 483 0=0
Split            splitncnn_3              1 2 483 483_splitncnn_0 483_splitncnn_1
Convolution      Conv_57                  1 1 483_splitncnn_1 834 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Clip             Clip_60                  1 1 834 488 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_61                  1 1 488 837 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Clip             Clip_64                  1 1 837 493 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_65                  1 1 493 840 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Split            splitncnn_4              1 2 840 840_splitncnn_0 840_splitncnn_1
Convolution      Conv_66                  1 1 840_splitncnn_1 843 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Clip             Clip_69                  1 1 843 500 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_70                  1 1 500 846 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Clip             Clip_73                  1 1 846 505 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_74                  1 1 505 849 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
BinaryOp         Add_75                   2 1 840_splitncnn_0 849 508 0=0
Split            splitncnn_5              1 2 508 508_splitncnn_0 508_splitncnn_1
Convolution      Conv_76                  1 1 508_splitncnn_1 852 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Clip             Clip_79                  1 1 852 513 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_80                  1 1 513 855 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Clip             Clip_83                  1 1 855 518 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_84                  1 1 518 858 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
BinaryOp         Add_85                   2 1 508_splitncnn_0 858 521 0=0
Convolution      Conv_86                  1 1 521 861 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Clip             Clip_89                  1 1 861 526 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_90                  1 1 526 864 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Clip             Clip_93                  1 1 864 531 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_94                  1 1 531 867 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Split            splitncnn_6              1 2 867 867_splitncnn_0 867_splitncnn_1
Convolution      Conv_95                  1 1 867_splitncnn_1 870 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Clip             Clip_98                  1 1 870 538 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_99                  1 1 538 873 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Clip             Clip_102                 1 1 873 543 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_103                 1 1 543 876 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
BinaryOp         Add_104                  2 1 867_splitncnn_0 876 546 0=0
Split            splitncnn_7              1 2 546 546_splitncnn_0 546_splitncnn_1
Convolution      Conv_105                 1 1 546_splitncnn_1 879 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Clip             Clip_108                 1 1 879 551 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_109                 1 1 551 882 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Clip             Clip_112                 1 1 882 556 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_113                 1 1 556 885 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
BinaryOp         Add_114                  2 1 546_splitncnn_0 885 559 0=0
Split            splitncnn_8              1 2 559 559_splitncnn_0 559_splitncnn_1
Convolution      Conv_115                 1 1 559_splitncnn_1 888 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Clip             Clip_118                 1 1 888 564 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_119                 1 1 564 891 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Clip             Clip_122                 1 1 891 569 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_123                 1 1 569 894 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=7680
Split            splitncnn_9              1 2 894 894_splitncnn_0 894_splitncnn_1
Convolution      Conv_124                 1 1 894_splitncnn_1 897 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
Clip             Clip_127                 1 1 897 576 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_128                 1 1 576 900 0=160 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1440 7=160
Clip             Clip_131                 1 1 900 581 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_132                 1 1 581 903 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
BinaryOp         Add_133                  2 1 894_splitncnn_0 903 584 0=0
Split            splitncnn_10             1 2 584 584_splitncnn_0 584_splitncnn_1
Convolution      Conv_134                 1 1 584_splitncnn_1 906 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
Clip             Clip_137                 1 1 906 589 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_138                 1 1 589 909 0=160 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1440 7=160
Clip             Clip_141                 1 1 909 594 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_142                 1 1 594 912 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
BinaryOp         Add_143                  2 1 584_splitncnn_0 912 597 0=0
Convolution      Conv_144                 1 1 597 915 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=25600
Clip             Clip_147                 1 1 915 602 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_148                 1 1 602 918 0=320 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2880 7=320
Clip             Clip_151                 1 1 918 607 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_152                 1 1 607 921 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=51200
Convolution      Conv_153                 1 1 483_splitncnn_0 924 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             LeakyRelu_154            1 1 924 612 0=1.000000e-01
Convolution      Conv_155                 1 1 559_splitncnn_0 927 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
ReLU             LeakyRelu_156            1 1 927 615 0=1.000000e-01
Convolution      Conv_157                 1 1 921 930 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5120
ReLU             LeakyRelu_158            1 1 930 618 0=1.000000e-01
Split            splitncnn_11             1 2 618 618_splitncnn_0 618_splitncnn_1
Interp           Resize_177               1 1 618_splitncnn_1 637 0=1 1=1.000000e+00 2=1.000000e+00 3=10 4=10 6=0
BinaryOp         Add_178                  2 1 615 637 638 0=0
Convolution      Conv_179                 1 1 638 933 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             LeakyRelu_180            1 1 933 641 0=1.000000e-01
Split            splitncnn_12             1 2 641 641_splitncnn_0 641_splitncnn_1
Interp           Resize_199               1 1 641_splitncnn_1 660 0=1 1=1.000000e+00 2=1.000000e+00 3=20 4=20 6=0
BinaryOp         Add_200                  2 1 612 660 661 0=0
Convolution      Conv_201                 1 1 661 936 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             LeakyRelu_202            1 1 936 664 0=1.000000e-01
Convolution      Conv_203                 1 1 664 939 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=18432
ReLU             LeakyRelu_204            1 1 939 667 0=0.000000e+00
Convolution      Conv_205                 1 1 667 942 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             LeakyRelu_206            1 1 942 670 0=0.000000e+00
Convolution      Conv_207                 1 1 670 945 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             LeakyRelu_208            1 1 945 673 0=0.000000e+00
Pooling          AveragePool_211          1 1 673 676 0=1 1=5 11=5 2=5 12=5 3=0 13=0 14=0 15=0 5=1 6=0
Convolution      Conv_212                 1 1 676 948 0=3 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=768
Reshape          Reshape_222              1 1 948 euler 0=3
Convolution      Conv_223                 1 1 641_splitncnn_0 951 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=18432
ReLU             LeakyRelu_224            1 1 951 691 0=0.000000e+00
Split            splitncnn_13             1 2 691 691_splitncnn_0 691_splitncnn_1
Convolution      Conv_225                 1 1 691_splitncnn_1 954 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             LeakyRelu_226            1 1 954 694 0=0.000000e+00
Pooling          AveragePool_229          1 1 694 697 0=1 1=5 11=5 2=5 12=5 3=0 13=0 14=0 15=0 5=1 6=0
Convolution      Conv_230                 1 1 697 957 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_231                 1 1 691_splitncnn_0 960 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             LeakyRelu_232            1 1 960 702 0=0.000000e+00
Pooling          AveragePool_235          1 1 702 705 0=1 1=5 11=5 2=5 12=5 3=0 13=0 14=0 15=0 5=1 6=0
Convolution      Conv_236                 1 1 705 963 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Reshape          Reshape_246              1 1 957 717 0=4
Reshape          Reshape_256              1 1 963 727 0=4
Softmax          Softmax_257              1 1 717 cls1 0=0 1=1
Sigmoid          Sigmoid_258              1 1 727 cls2
Convolution      Conv_259                 1 1 618_splitncnn_0 966 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_267                  1 1 966 739 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_14             1 2 739 739_splitncnn_0 739_splitncnn_1
Pooling          GlobalAveragePool_268    1 1 739_splitncnn_1 740 0=1 4=1
Convolution      Conv_269                 1 1 740 969 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_270                 1 1 969 743
Convolution      Conv_271                 1 1 743 972 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSigmoid      Div_278                  1 1 972 752 0=1.666667e-01 1=5.000000e-01
BinaryOp         Mul_279                  2 1 739_splitncnn_0 752 753 0=2
Pooling          AveragePool_282          1 1 753 756 0=1 1=5 11=5 2=5 12=5 3=0 13=0 14=0 15=0 5=1 6=0
Convolution      Conv_283                 1 1 756 975 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
HardSwish        Div_291                  1 1 975 766 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_292                 1 1 766 978 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=10240
ReLU             LeakyRelu_293            1 1 978 769 0=0.000000e+00
Reshape          Reshape_303              1 1 769 lds 0=40
