7767517
295 333
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 1974 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
ReLU             LeakyRelu_1              1 1 1974 1535 0=1.000000e-01
ConvolutionDepthWise Conv_2                   1 1 1535 1977 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_3              1 1 1977 1538 0=1.000000e-01
Convolution      Conv_4                   1 1 1538 1980 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Convolution      Conv_5                   1 1 1980 1983 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_6              1 1 1983 1543 0=1.000000e-01
ConvolutionDepthWise Conv_7                   1 1 1543 1986 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             LeakyRelu_8              1 1 1986 1546 0=1.000000e-01
Convolution      Conv_9                   1 1 1546 1989 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Split            splitncnn_0              1 2 1989 1989_splitncnn_0 1989_splitncnn_1
Convolution      Conv_10                  1 1 1989_splitncnn_1 1992 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             LeakyRelu_11             1 1 1992 1551 0=1.000000e-01
ConvolutionDepthWise Conv_12                  1 1 1551 1995 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_13             1 1 1995 1554 0=1.000000e-01
Convolution      Conv_14                  1 1 1554 1998 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
BinaryOp         Add_15                   2 1 1989_splitncnn_0 1998 1557 0=0
Convolution      Conv_16                  1 1 1557 2001 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             LeakyRelu_17             1 1 2001 1560 0=1.000000e-01
ConvolutionDepthWise Conv_18                  1 1 1560 2004 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_19             1 1 2004 1563 0=1.000000e-01
Convolution      Conv_20                  1 1 1563 2007 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Split            splitncnn_1              1 2 2007 2007_splitncnn_0 2007_splitncnn_1
Convolution      Conv_21                  1 1 2007_splitncnn_1 2010 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             LeakyRelu_22             1 1 2010 1568 0=1.000000e-01
ConvolutionDepthWise Conv_23                  1 1 1568 2013 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_24             1 1 2013 1571 0=1.000000e-01
Convolution      Conv_25                  1 1 1571 2016 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
BinaryOp         Add_26                   2 1 2007_splitncnn_0 2016 1574 0=0
Split            splitncnn_2              1 2 1574 1574_splitncnn_0 1574_splitncnn_1
Convolution      Conv_27                  1 1 1574_splitncnn_1 2019 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             LeakyRelu_28             1 1 2019 1577 0=1.000000e-01
ConvolutionDepthWise Conv_29                  1 1 1577 2022 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_30             1 1 2022 1580 0=1.000000e-01
Convolution      Conv_31                  1 1 1580 2025 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
BinaryOp         Add_32                   2 1 1574_splitncnn_0 2025 1583 0=0
Split            splitncnn_3              1 2 1583 1583_splitncnn_0 1583_splitncnn_1
Convolution      Conv_33                  1 1 1583_splitncnn_1 2028 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             LeakyRelu_34             1 1 2028 1586 0=1.000000e-01
ConvolutionDepthWise Conv_35                  1 1 1586 2031 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             LeakyRelu_36             1 1 2031 1589 0=1.000000e-01
Convolution      Conv_37                  1 1 1589 2034 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Split            splitncnn_4              1 2 2034 2034_splitncnn_0 2034_splitncnn_1
Convolution      Conv_38                  1 1 2034_splitncnn_1 2037 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             LeakyRelu_39             1 1 2037 1594 0=1.000000e-01
ConvolutionDepthWise Conv_40                  1 1 1594 2040 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_41             1 1 2040 1597 0=1.000000e-01
Convolution      Conv_42                  1 1 1597 2043 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
BinaryOp         Add_43                   2 1 2034_splitncnn_0 2043 1600 0=0
Split            splitncnn_5              1 2 1600 1600_splitncnn_0 1600_splitncnn_1
Convolution      Conv_44                  1 1 1600_splitncnn_1 2046 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             LeakyRelu_45             1 1 2046 1603 0=1.000000e-01
ConvolutionDepthWise Conv_46                  1 1 1603 2049 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_47             1 1 2049 1606 0=1.000000e-01
Convolution      Conv_48                  1 1 1606 2052 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
BinaryOp         Add_49                   2 1 1600_splitncnn_0 2052 1609 0=0
Convolution      Conv_50                  1 1 1609 2055 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             LeakyRelu_51             1 1 2055 1612 0=1.000000e-01
ConvolutionDepthWise Conv_52                  1 1 1612 2058 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_53             1 1 2058 1615 0=1.000000e-01
Convolution      Conv_54                  1 1 1615 2061 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Split            splitncnn_6              1 2 2061 2061_splitncnn_0 2061_splitncnn_1
Convolution      Conv_55                  1 1 2061_splitncnn_1 2064 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
ReLU             LeakyRelu_56             1 1 2064 1620 0=1.000000e-01
ConvolutionDepthWise Conv_57                  1 1 1620 2067 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_58             1 1 2067 1623 0=1.000000e-01
Convolution      Conv_59                  1 1 1623 2070 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
BinaryOp         Add_60                   2 1 2061_splitncnn_0 2070 1626 0=0
Split            splitncnn_7              1 2 1626 1626_splitncnn_0 1626_splitncnn_1
Convolution      Conv_61                  1 1 1626_splitncnn_1 2073 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
ReLU             LeakyRelu_62             1 1 2073 1629 0=1.000000e-01
ConvolutionDepthWise Conv_63                  1 1 1629 2076 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_64             1 1 2076 1632 0=1.000000e-01
Convolution      Conv_65                  1 1 1632 2079 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
BinaryOp         Add_66                   2 1 1626_splitncnn_0 2079 1635 0=0
Split            splitncnn_8              1 2 1635 1635_splitncnn_0 1635_splitncnn_1
Convolution      Conv_67                  1 1 1635_splitncnn_1 2082 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
ReLU             LeakyRelu_68             1 1 2082 1638 0=1.000000e-01
ConvolutionDepthWise Conv_69                  1 1 1638 2085 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             LeakyRelu_70             1 1 2085 1641 0=1.000000e-01
Convolution      Conv_71                  1 1 1641 2088 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=7680
Split            splitncnn_9              1 2 2088 2088_splitncnn_0 2088_splitncnn_1
Convolution      Conv_72                  1 1 2088_splitncnn_1 2091 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
ReLU             LeakyRelu_73             1 1 2091 1646 0=1.000000e-01
ConvolutionDepthWise Conv_74                  1 1 1646 2094 0=160 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1440 7=160
ReLU             LeakyRelu_75             1 1 2094 1649 0=1.000000e-01
Convolution      Conv_76                  1 1 1649 2097 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
BinaryOp         Add_77                   2 1 2088_splitncnn_0 2097 1652 0=0
Split            splitncnn_10             1 2 1652 1652_splitncnn_0 1652_splitncnn_1
Convolution      Conv_78                  1 1 1652_splitncnn_1 2100 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
ReLU             LeakyRelu_79             1 1 2100 1655 0=1.000000e-01
ConvolutionDepthWise Conv_80                  1 1 1655 2103 0=160 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1440 7=160
ReLU             LeakyRelu_81             1 1 2103 1658 0=1.000000e-01
Convolution      Conv_82                  1 1 1658 2106 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800
BinaryOp         Add_83                   2 1 1652_splitncnn_0 2106 1661 0=0
Convolution      Conv_84                  1 1 1661 2109 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=25600
ReLU             LeakyRelu_85             1 1 2109 1664 0=1.000000e-01
ConvolutionDepthWise Conv_86                  1 1 1664 2112 0=320 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2880 7=320
ReLU             LeakyRelu_87             1 1 2112 1667 0=1.000000e-01
Convolution      Conv_88                  1 1 1667 2115 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=51200
Convolution      Conv_89                  1 1 2115 2118 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=15360
ReLU             LeakyRelu_90             1 1 2118 1672 0=1.000000e-01
Split            splitncnn_11             1 2 1672 1672_splitncnn_0 1672_splitncnn_1
Convolution      Conv_91                  1 1 1583_splitncnn_0 2121 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_92             1 1 2121 1675 0=1.000000e-01
Convolution      Conv_93                  1 1 1635_splitncnn_0 2124 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=768
ReLU             LeakyRelu_94             1 1 2124 1678 0=1.000000e-01
Convolution      Conv_95                  1 1 1672_splitncnn_1 2127 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
ReLU             LeakyRelu_96             1 1 2127 1681 0=1.000000e-01
Split            splitncnn_12             1 3 1681 1681_splitncnn_0 1681_splitncnn_1 1681_splitncnn_2
Interp           Resize_98                1 1 1681_splitncnn_2 1686 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_99                2 1 1686 1678 1687 0=0
Split            splitncnn_13             1 2 1687 1687_splitncnn_0 1687_splitncnn_1
Convolution      Conv_100                 1 1 1687_splitncnn_1 2130 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_101            1 1 2130 1690 0=1.000000e-01
Split            splitncnn_14             1 2 1690 1690_splitncnn_0 1690_splitncnn_1
ConvolutionDepthWise Conv_102                 1 1 1690_splitncnn_1 2133 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
ReLU             LeakyRelu_103            1 1 2133 1693 0=1.000000e-01
Concat           Concat_104               2 1 1690_splitncnn_0 1693 1694 0=0
Convolution      Conv_105                 1 1 1694 2136 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Split            splitncnn_15             1 2 2136 2136_splitncnn_0 2136_splitncnn_1
ConvolutionDepthWise Conv_106                 1 1 2136_splitncnn_1 2139 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
Concat           Concat_107               2 1 2136_splitncnn_0 2139 1699 0=0
ConvolutionDepthWise Conv_108                 1 1 1687_splitncnn_0 2142 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Convolution      Conv_109                 1 1 2142 2145 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
BinaryOp         Add_110                  2 1 1699 2145 1704 0=0
Split            splitncnn_16             1 2 1704 1704_splitncnn_0 1704_splitncnn_1
Interp           Resize_112               1 1 1704_splitncnn_1 1709 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_113               2 1 1709 1675 1710 0=0
Split            splitncnn_17             1 2 1710 1710_splitncnn_0 1710_splitncnn_1
Convolution      Conv_114                 1 1 1710_splitncnn_1 2148 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_115            1 1 2148 1713 0=1.000000e-01
Split            splitncnn_18             1 2 1713 1713_splitncnn_0 1713_splitncnn_1
ConvolutionDepthWise Conv_116                 1 1 1713_splitncnn_1 2151 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
ReLU             LeakyRelu_117            1 1 2151 1716 0=1.000000e-01
Concat           Concat_118               2 1 1713_splitncnn_0 1716 1717 0=0
Convolution      Conv_119                 1 1 1717 2154 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Split            splitncnn_19             1 2 2154 2154_splitncnn_0 2154_splitncnn_1
ConvolutionDepthWise Conv_120                 1 1 2154_splitncnn_1 2157 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
Concat           Concat_121               2 1 2154_splitncnn_0 2157 1722 0=0
ConvolutionDepthWise Conv_122                 1 1 1710_splitncnn_0 2160 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Convolution      Conv_123                 1 1 2160 2163 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
BinaryOp         Add_124                  2 1 1722 2163 1727 0=0
Split            splitncnn_20             1 4 1727 1727_splitncnn_0 1727_splitncnn_1 1727_splitncnn_2 1727_splitncnn_3
Convolution      Conv_125                 1 1 1727_splitncnn_3 2166 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_126            1 1 2166 1730 0=1.000000e-01
Concat           Concat_127               2 1 1730 1704_splitncnn_0 1731 0=0
Split            splitncnn_21             1 2 1731 1731_splitncnn_0 1731_splitncnn_1
Convolution      Conv_128                 1 1 1731_splitncnn_1 2169 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_129            1 1 2169 1734 0=1.000000e-01
Split            splitncnn_22             1 2 1734 1734_splitncnn_0 1734_splitncnn_1
ConvolutionDepthWise Conv_130                 1 1 1734_splitncnn_1 2172 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
ReLU             LeakyRelu_131            1 1 2172 1737 0=1.000000e-01
Concat           Concat_132               2 1 1734_splitncnn_0 1737 1738 0=0
Convolution      Conv_133                 1 1 1738 2175 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Split            splitncnn_23             1 2 2175 2175_splitncnn_0 2175_splitncnn_1
ConvolutionDepthWise Conv_134                 1 1 2175_splitncnn_1 2178 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
Concat           Concat_135               2 1 2175_splitncnn_0 2178 1743 0=0
ConvolutionDepthWise Conv_136                 1 1 1731_splitncnn_0 2181 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Convolution      Conv_137                 1 1 2181 2184 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
BinaryOp         Add_138                  2 1 1743 2184 1748 0=0
Split            splitncnn_24             1 4 1748 1748_splitncnn_0 1748_splitncnn_1 1748_splitncnn_2 1748_splitncnn_3
Convolution      Conv_139                 1 1 1748_splitncnn_3 2187 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_140            1 1 2187 1751 0=1.000000e-01
Concat           Concat_141               2 1 1751 1681_splitncnn_1 1752 0=0
Split            splitncnn_25             1 2 1752 1752_splitncnn_0 1752_splitncnn_1
Convolution      Conv_142                 1 1 1752_splitncnn_1 2190 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_143            1 1 2190 1755 0=1.000000e-01
Split            splitncnn_26             1 2 1755 1755_splitncnn_0 1755_splitncnn_1
ConvolutionDepthWise Conv_144                 1 1 1755_splitncnn_1 2193 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
ReLU             LeakyRelu_145            1 1 2193 1758 0=1.000000e-01
Concat           Concat_146               2 1 1755_splitncnn_0 1758 1759 0=0
Convolution      Conv_147                 1 1 1759 2196 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Split            splitncnn_27             1 2 2196 2196_splitncnn_0 2196_splitncnn_1
ConvolutionDepthWise Conv_148                 1 1 2196_splitncnn_1 2199 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
Concat           Concat_149               2 1 2196_splitncnn_0 2199 1764 0=0
ConvolutionDepthWise Conv_150                 1 1 1752_splitncnn_0 2202 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Convolution      Conv_151                 1 1 2202 2205 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
BinaryOp         Add_152                  2 1 1764 2205 1769 0=0
Split            splitncnn_28             1 4 1769 1769_splitncnn_0 1769_splitncnn_1 1769_splitncnn_2 1769_splitncnn_3
Convolution      Conv_153                 1 1 1681_splitncnn_0 2208 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_154            1 1 2208 1772 0=1.000000e-01
Convolution      Conv_155                 1 1 1769_splitncnn_3 2211 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_156            1 1 2211 1775 0=1.000000e-01
BinaryOp         Add_157                  2 1 1772 1775 1776 0=0
Split            splitncnn_29             1 3 1776 1776_splitncnn_0 1776_splitncnn_1 1776_splitncnn_2
Convolution      Conv_158                 1 1 1672_splitncnn_0 2214 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=55296
ReLU             LeakyRelu_159            1 1 2214 1779 0=1.000000e-01
Convolution      Conv_160                 1 1 1779 2217 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             LeakyRelu_161            1 1 2217 1782 0=1.000000e-01
ConvolutionDepthWise Conv_162                 1 1 1782 2220 0=64 1=7 11=4 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1792 7=64
Reshape          Reshape_168              1 1 2220 1792 0=-1
InnerProduct     Gemm_169                 1 1 1792 1793 0=5 1=1 2=320
ConvolutionDepthWise Conv_171                 1 1 1727_splitncnn_2 2223 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_172            1 1 2223 1797 0=1.000000e-01
Convolution      Conv_173                 1 1 1797 2226 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_174            1 1 2226 1800 0=1.000000e-01
ConvolutionDepthWise Conv_175                 1 1 1800 2229 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_176            1 1 2229 1803 0=1.000000e-01
Convolution      Conv_177                 1 1 1803 2232 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_178            1 1 2232 1806 0=1.000000e-01
Convolution      Conv_179                 1 1 1806 1807 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
ConvolutionDepthWise Conv_180                 1 1 1727_splitncnn_1 2235 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_181            1 1 2235 1810 0=1.000000e-01
Convolution      Conv_182                 1 1 1810 2238 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_183            1 1 2238 1813 0=1.000000e-01
ConvolutionDepthWise Conv_184                 1 1 1813 2241 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_185            1 1 2241 1816 0=1.000000e-01
Convolution      Conv_186                 1 1 1816 2244 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_187            1 1 2244 1819 0=1.000000e-01
Convolution      Conv_188                 1 1 1819 bbox8 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
Convolution      Conv_189                 1 1 1727_splitncnn_0 2247 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_190            1 1 2247 1823 0=1.000000e-01
Convolution      Conv_191                 1 1 1823 2250 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_192            1 1 2250 1826 0=1.000000e-01
Convolution      Conv_193                 1 1 1826 1827 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16
Sigmoid          Sigmoid_194              1 1 1827 obj8
Sigmoid          Sigmoid_195              1 1 1807 cls8
ConvolutionDepthWise Conv_197                 1 1 1748_splitncnn_2 2253 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_198            1 1 2253 1833 0=1.000000e-01
Convolution      Conv_199                 1 1 1833 2256 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_200            1 1 2256 1836 0=1.000000e-01
ConvolutionDepthWise Conv_201                 1 1 1836 2259 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_202            1 1 2259 1839 0=1.000000e-01
Convolution      Conv_203                 1 1 1839 2262 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_204            1 1 2262 1842 0=1.000000e-01
Convolution      Conv_205                 1 1 1842 1843 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
ConvolutionDepthWise Conv_206                 1 1 1748_splitncnn_1 2265 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_207            1 1 2265 1846 0=1.000000e-01
Convolution      Conv_208                 1 1 1846 2268 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_209            1 1 2268 1849 0=1.000000e-01
ConvolutionDepthWise Conv_210                 1 1 1849 2271 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_211            1 1 2271 1852 0=1.000000e-01
Convolution      Conv_212                 1 1 1852 2274 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_213            1 1 2274 1855 0=1.000000e-01
Convolution      Conv_214                 1 1 1855 bbox16 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
Convolution      Conv_215                 1 1 1748_splitncnn_0 2277 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_216            1 1 2277 1859 0=1.000000e-01
Convolution      Conv_217                 1 1 1859 2280 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_218            1 1 2280 1862 0=1.000000e-01
Convolution      Conv_219                 1 1 1862 1863 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16
Sigmoid          Sigmoid_220              1 1 1863 obj16
Sigmoid          Sigmoid_221              1 1 1843 cls16
ConvolutionDepthWise Conv_223                 1 1 1769_splitncnn_2 2283 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_224            1 1 2283 1869 0=1.000000e-01
Convolution      Conv_225                 1 1 1869 2286 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_226            1 1 2286 1872 0=1.000000e-01
ConvolutionDepthWise Conv_227                 1 1 1872 2289 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_228            1 1 2289 1875 0=1.000000e-01
Convolution      Conv_229                 1 1 1875 2292 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_230            1 1 2292 1878 0=1.000000e-01
Convolution      Conv_231                 1 1 1878 1879 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
ConvolutionDepthWise Conv_232                 1 1 1769_splitncnn_1 2295 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_233            1 1 2295 1882 0=1.000000e-01
Convolution      Conv_234                 1 1 1882 2298 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_235            1 1 2298 1885 0=1.000000e-01
ConvolutionDepthWise Conv_236                 1 1 1885 2301 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_237            1 1 2301 1888 0=1.000000e-01
Convolution      Conv_238                 1 1 1888 2304 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_239            1 1 2304 1891 0=1.000000e-01
Convolution      Conv_240                 1 1 1891 bbox32 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
Convolution      Conv_241                 1 1 1769_splitncnn_0 2307 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_242            1 1 2307 1895 0=1.000000e-01
Convolution      Conv_243                 1 1 1895 2310 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_244            1 1 2310 1898 0=1.000000e-01
Convolution      Conv_245                 1 1 1898 1899 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16
Sigmoid          Sigmoid_246              1 1 1899 obj32
Sigmoid          Sigmoid_247              1 1 1879 cls32
ConvolutionDepthWise Conv_249                 1 1 1776_splitncnn_2 2313 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_250            1 1 2313 1905 0=1.000000e-01
Convolution      Conv_251                 1 1 1905 2316 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_252            1 1 2316 1908 0=1.000000e-01
ConvolutionDepthWise Conv_253                 1 1 1908 2319 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_254            1 1 2319 1911 0=1.000000e-01
Convolution      Conv_255                 1 1 1911 2322 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_256            1 1 2322 1914 0=1.000000e-01
Convolution      Conv_257                 1 1 1914 1915 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
ConvolutionDepthWise Conv_258                 1 1 1776_splitncnn_1 2325 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_259            1 1 2325 1918 0=1.000000e-01
Convolution      Conv_260                 1 1 1918 2328 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_261            1 1 2328 1921 0=1.000000e-01
ConvolutionDepthWise Conv_262                 1 1 1921 2331 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_263            1 1 2331 1924 0=1.000000e-01
Convolution      Conv_264                 1 1 1924 2334 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             LeakyRelu_265            1 1 2334 1927 0=1.000000e-01
Convolution      Conv_266                 1 1 1927 bbox64 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
Convolution      Conv_267                 1 1 1776_splitncnn_0 2337 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_268            1 1 2337 1931 0=1.000000e-01
Convolution      Conv_269                 1 1 1931 2340 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_270            1 1 2340 1934 0=1.000000e-01
Convolution      Conv_271                 1 1 1934 1935 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16
Sigmoid          Sigmoid_272              1 1 1935 obj64
Sigmoid          Sigmoid_273              1 1 1915 cls64
Sigmoid          Sigmoid_309              1 1 1793 output_1
